<?php
$lang = array(

   /* <?php echo $lang['...'] ?> */

   /* NOTE Title */
   "title" => "第1小组--任务1--创新技术II",


   /* NOTE Header */
   "header1" => "总览",
   "header2" => "现场状态",
   "header3" => "单一视图",
   "header4" => "图例单视图",
   "header_logo_subtitle" => "为你的生产开绿灯。",

   /* NOTE Module */
   "module1" => "高架仓库",
   "module2" => "抽吸垫",
   "module3" => "窑炉",
   "module4" => "分拣线",
   "module5" => "转移模块",


   /* NOTE Sensoren & Aktoren Module */
   "module1.1" => "横向参考按钮",
   "module1.2" => "内部有光屏障",
   "module1.3" => "外面的光屏障",
   "module1.4" => "垂直参考按钮",
   "module1.5" => "前支腿参考按钮",
   "module1.6" => "后支腿参考按钮",
   "module1.7" => "H-垂直",
   "module1.8" => "H-水平方向",

   "module2.1" => "V-参考开关垂直l",
   "module2.2" => "V-参考开关水平",
   "module2.3" => "V-转动参考开关",
   "module2.4" => "V-纵向",
   "module2.5" => "V-横向",
   "module2.6" => "V-轮换",

   "module3.1" => "B-参考开关转盘（位置：吸盘）",
   "module3.2" => "B-参考开关转盘（位置传送带）",
   "module3.3" => "B-轻型障碍物末端输送带",
   "module3.4" => "B-参考开关转盘（位置见）",
   "module3.5" => "B-参考开关吸气（位置：转盘）",
   "module3.6" => "B-参考开关 炉内滑动",
   "module3.7" => "B-参考开关 炉子外面的滑道",
   "module3.8" => "B-参考开关吸气（位置：窑炉）",
   "module3.9" => "B-轻度阻隔窑炉",
   "module3.10" => "B-电机转盘顺时针旋转",
   "module3.11" => "B-电机转盘逆时针旋转",
   "module3.12" => "B-电机传送带前进",
   "module3.13" => "B-电锯",
   "module3.14" => "B-电机炉滑块缩回",
   "module3.15" => "B-电机烤箱滑轨伸出",
   "module3.16" => "B-电机对炉子的吸力",
   "module3.17" => "B-电机吸盘到回旋环",
   "module3.18" => "B-烤箱照明器",

   "module4.1" => "S-光屏障输入",
   "module4.2" => "S-彩色传感器后的光屏障",
   "module4.3" => "S-光屏障白",
   "module4.4" => "S-红色光障",
   "module4.5" => "S-浅色屏障蓝",
   "module4.6" => "S-电机传送带",

   "module5.1" => "转换器端部停止 1 （3B1）",
   "module5.2" => "转换器端部停止 2 （3B2）",



   /* NOTE Gesamtübersicht */


   /* NOTE Live Status */
   "table_h1" => "传感器/执行器:",
   "table_h2" => "不活跃/活跃:",


   /* NOTE Einzelübersicht */
   "single_view_h1" => "查看:",
   "single_view_h1.1" => "顶视图",
   "single_view_h1.2" => "侧面图",
   "single_view_h1.3" => "顶部和侧面视图",

   "single_view_h2" => "描述:",
   "single_view_h3" => "传感器和执行器的状态:",



   /* NOTE Einzelübersicht Beschreibungen */
   "module1_desc" => "高架仓库是一种节省空间的仓库，能够实现计算机辅助的货物存储和检索。在大多数情况下，高架仓库被设计成托盘式货架仓库。这种标准化实现了高度的自动化并与ERP系统（企业资源规划）相连接。高架仓库的特点是空间利用率高，投资要求高。",

   "module2_desc" => "工业机器人是普遍适用的自动运动机器，有几个轴，其运动可自由编程（即没有机械或人为干预），必要时，在运动顺序和路径或角度方面由传感器指导。它们可以配备夹持器、工具或其他制造设备，并可以执行搬运和/或制造任务。",

   "module3_desc" => "在带炉子的多加工站中，工件自动通过几个模拟不同工艺的站。使用了各种输送技术，如传送带、转盘和真空抽吸式夹持器。加工过程从炉子开始。一旦工件放在炉子的滑道上，就应立即开始加工。这就中断了光障，这应该使窑炉的门打开，窑炉的滑道缩回。",

   "module4_desc" => "带颜色识别的分拣线用于自动分离不同颜色的成分。在这里，几何上相同但颜色不同的部件在传送带的帮助下被送入一个颜色传感器，然后根据其颜色进行分离。输送带由一个S型电机驱动，输送路径由一个脉冲传感器帮助测量。工件的弹出是通过分配给相应的轴承点并由电磁阀驱动的气动缸完成的。几个光屏障控制着工件的流动以及工件是否在存储位置。",

   "module5_desc" => "堆垛库有一个库管，最多可以容纳8个工件，可以单独送入增值过程。这是由一个双作用的气缸来完成的，它将工件单独推上。末端位置由传感器检测。
   摇臂是传输模块的一部分，确保分离的工件从堆垛库的末端位置被接管。",


   /* NOTE Legende */
   "legende_h" => "图像颜色的图例",
   "legende_subtitle" => "各个视图中的颜色定义",

   "legende_table_header1" => "执行器/传感器名称",
   "legende_table_header2" => "颜色",

   "legende1.1" => "光屏障",
   "legende2.1" => "电机",
   "legende3.1" => "钮扣",
   "legende4.1" => "开关",
   "legende5.1" => "灯具",


   /* NOTE Footer */
   "footer1" => "代表者",


);
